bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Lamont"], ["description", "Lives in Monster Mansion. Very lonely. All he wants is a friend."], ["created_at", "2016-06-15 13:50:46.026989"], ["updated_at", "2016-06-15 13:50:46.026989"]]
---
  def create
    creature = Creature.new(creature_params)

    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "A frog. Plays banjo and sings. Loves pigs"], ["updated_at", "2016-06-15 14:05:15.834820"], ["id", 5]]
---
  def update
    creature_id = params[:id]

    creature = Creature.find_by_id(creature_id)

    creature.update_attributes(creature_params)